//
//  StringDescription.swift
//  OCRTextTrans
//
//  Created by 이학진 on 2022/08/11.
//

import Foundation

struct StringDescription {
    // 권한 메시지 수정 예정
    enum CamPermission: String {
        case title = "카메라 접근이 거부되었습니다."
        case content = "카메라 사용을 원하시는 경우, 설정에서 카메라의 권한을 승인해주세요."
    }
    enum TransField: String {
        case textholder =
        """
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.
        """
        
        case placeholder = """
        네게는 불멸의 향기가 있다. 네게는 황금의 음률이 있다. 네게는 영원한 생각의 감초인 보금자리가 있다. 네게는 이제 혜성같이 나타날 보이지 않는 영광이 있다.

         

        너는 동산같이 그윽하다.

        너는 대양(大洋)같이 뛰논다.

        너는 미풍같이 소곤거린다.

        너는 처녀같이 꿈꾼다.

         

        너는 우리의 신부(新婦)다.

        너는 우리의 운명이다.

        너는 우리의 호흡이다.

        너는 우리의 전부이다.

        아하, 내 사랑 내 희망아, 이 일을 어쩌리.

        네 발등에 향유를 부어 주진 못할망정,

        네 목에 황금의 목걸이를 걸어 주진 못할망정,

        도리어 네 머리 위에 가시관을 얹다니,

        가시관을 얹다니……

        아하, 내 사랑 내 희망아, 세상에 이럴 법이…

         

        우리는 못났구나, 기막힌 바보로구나.

        그러나, 그렇다고 버릴 너는 아니겠지, 설마.

        아하, 내 사랑 내 희망아, 내 귀에 네 입술을 대어 다오.

        그리고, 다짐해 다오, 다짐해 다오.
"""
    }
}
